Revit 2026 API

# IExternalCommandAvailability Methods

---

The IExternalCommandAvailability type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsCommandAvailable | Implement this method to provide control over whether your external command is enabled or disabled. |

#### Reference

IExternalCommandAvailability Interface

Autodesk.Revit.UI Namespace